{
  "sidebar":{
    "home": "Inicio",
    "projects": "Proyectos",
    "services": "Servicios",
    "blog": "Blog",
    "cv": "CV",
    "contact": "Contacto"
  },
  "index": {
    "greetings": "Bienvenido a mi espacio de desarrollo! 游",
    "title": "Yo soy David Conde Cubas",
    "description": "Soy un ingeniero de software con un compromiso constante de aprender y mejorar. Mi enfoque abarca tanto el desarrollo backend como el frontend. En el backend, utilizo tecnolog칤as como Java y Python para construir sistemas robustos. En el frontend, me sumerjo en el dise침o de interfaces atractivas utilizando tecnolog칤as modernas como React.<0>Este espacio digital es un reflejo de mi pasi칩n por la ingenier칤a de software y mi deseo constante de crecimiento. A trav칠s de mis proyectos, podr치s explorar mi enfoque en la resoluci칩n de problemas y mi dedicaci칩n a crear soluciones tecnol칩gicas efectivas.<1><2>Si tienes preguntas, propuestas o simplemente deseas conectarte, estoy aqu칤. 춰Gracias por visitar mi portafolio!</2>",
    "last_projects": {
      "title": "Mis 칰ltimos proyectos",
      "items": {
        "one": {
          "title": "P치gina Web de Portfolio",
          "desc": "Este repositorio alberga mi portafolio web, construido con Astro. Este proyecto es el escaparate digital de mi experiencia y habilidades en el mundo del desarrollo de software."
        },
        "two":{},
        "three":{}
      }
    }
  },
  "project": {
    "title": "Proyectos"
  },
  "service": {
      "title": "Servicios",
      "one": {
        "title": "Automatizaci칩n de Procesos",
        "desc": "Desarrollo de scripts y herramientas para automatizar tareas recurrentes, mejorando la eficiencia en las fases de desarrollo y despliegue de software. Esto no solo reduce posibles errores humanos, sino que tambi칠n acelera el ciclo de desarrollo, desde la codificaci칩n hasta el despliegue, optimizando recursos y permitiendo un enfoque m치s 치gil y eficaz en la ingenier칤a de software.",
        "img": "/tech_imgs/automatic-process.svg"
      },
      "two": {
        "title": "Desarrollo de paginas web",
        "desc": "Al considerar las necesidades del cliente, la elecci칩n de la tecnolog칤a adecuada es fundamental. Para integraci칩n empresarial y desarrollo web integral, Odoo se presenta como una opci칩n id칩nea, siendo especialmente adecuado para empresas que buscan soluciones completas. En el caso de proyectos web que priorizan interfaces de usuario interactivas y din치micas, React emerge como una elecci칩n destacada, atrayendo a aquellos que buscan modernidad e interactividad. Mientras tanto, para sitios web con un enfoque primordial en la eficiencia de carga y rendimiento, Astro se presenta como la opci칩n preferida, especialmente para aquellos clientes que valoran la velocidad y la optimizaci칩n en sus plataformas en l칤nea.",
        "img": "/tech_imgs/web-page.svg"
      },
      "three": {
        "title": "",
        "desc": "",
        "img": "/tech_imgs/programmer.svg"
      }
  },
  "cv": {
    "profile": {
      "title": "Perfil",
      "description": "Con experiencia en ingenier칤a de software, he participado en el desarrollo de microservicios en Java, aplicando una arquitectura hexagonal para mejorar la modularidad y reducir las dependencias. Mi compromiso con pr치cticas de Clean Code y principios SOLID busca garantizar la claridad del c칩digo, respaldado por mi familiaridad con Java 17. En el 치mbito bancario, contribu칤 modestamente a mejorar la eficiencia de sistemas heredados. Tambi칠n he trabajado con Python en el marco de Odoo, enfoc치ndome en el desarrollo de m칩dulos personalizados y la utilizaci칩n de la API. Mi experiencia incluye aplicaciones de gesti칩n escolar en Java 8, microservicios con Spring Boot y JPA, la creaci칩n de APIs en Node.js, y el trabajo con bases de datos como PostgreSQL y SQL Server. En DevOps, he participado en la configuraci칩n de entornos locales y he adquirido habilidades en Docker. Mi enfoque es seguir aprendiendo y contribuir con soluciones pr치cticas en diversos entornos tecnol칩gicos."
    },
    "education": {
      "title": "Educaci칩n",
      "one": {
        "title": "M치ster Universitario en Direcci칩n de Proyectos Inform치ticos",
        "description": "Septiembre/2022 - actualidad en la Universidad de Alcal치, Madrid, Spain"
      },
      "two": { 
        "title": "Grado en Ingenieria de Software",
        "description": "Septiembre/2016 - Febrero/2022 en la Universidad Complutense de Madrid, Madrid, Spain"
      }
    },
    "jobs": {
      "title": "Experiencia",
      "one": {
        "title": "Ingenierio de Software",
        "subtitle": "Julio/2022 - actualidad en ING, Madrid, Spain",
        "description": "He participado activamente en el desarrollo de microservicios en Java, implementando una arquitectura hexagonal que favorece la modularidad y minimiza las interdependencias entre los componentes. He cultivado un compromiso firme con las pr치cticas de Clean Code y he aplicado los principios SOLID para asegurar la legibilidad y mantenibilidad del c칩digo. Mi experiencia abarca el uso de Java 17, manteni칠ndome actualizado con las 칰ltimas tecnolog칤as para asegurar el rendimiento 칩ptimo de las soluciones. Adem치s, he desempe침ado un papel esencial en la mejora de la parte legacy del banco, introduciendo modificaciones que han fortalecido la eficiencia y la funcionalidad de los sistemas existentes. Mi enfoque proactivo y mi capacidad para abordar tanto tecnolog칤as emergentes como 치reas heredadas me han permitido ofrecer soluciones integrales y de alto rendimiento en el 치mbito de la ingenier칤a de software."
      },
      "two": {
        "title": "Programador Fullstack",
        "subtitle": "Diciembre/2021 - Julio/2023 en Dominion Global, Madrid, Spain",
        "description": "En esta experiencia profesional, he liderado la implementaci칩n de una aplicaci칩n React vinculada a Power BI, aportando habilidades clave en el desarrollo frontend. Asimismo, he destacado en el 치mbito de Java, donde he dise침ado y desarrollado Microservicios utilizando las versiones 16 y 17, empleando Spring Boot, JPA y una arquitectura Hexagonal para lograr un desacoplamiento efectivo. En el 치mbito de AWS, he contribuido al desarrollo de funciones Lambda en Python y Java, ejecutado trabajos mediante Glue y Pyspark, y creado flujos de trabajo en Airflow con enfoque en Python. Adem치s, he participado activamente en despliegues de contenedores utilizando ECS y ECR, as칤 como en la gesti칩n de diversos servicios dentro de la plataforma. Adem치s, mi experiencia abarca el mantenimiento de aplicaciones legacy y la dockerizaci칩n de aplicaciones para garantizar una implementaci칩n eficiente y escalable."
      },
      "three": {
        "title":"Programador Fullstack",
        "subtitle": "Noviembre/2017 - Diciembre/2021 en EduwebGroup S.L., Madrid, Spain",
        "description": "A lo largo de esta experiencia carrera, me he destacado en diversas tecnolog칤as. En Python, espec칤ficamente dentro del marco de Odoo, he liderado el desarrollo de m칩dulos personalizados, incluyendo importadores de datos, sincronizadores con otros sistemas y extensiones de m칩dulos propietarios. Tambi칠n he contribuido a proyectos que utilizan la API de servicios web de Odoo para un backend robusto. En Java, he implementado aplicaciones de gesti칩n escolar utilizando Java 8 con SPRING MVC y me he adentrado en el desarrollo de microservicios con Spring Boot y JPA. En Node.js, me he especializado en la creaci칩n de APIs para proyectos que requieren una capa s칩lida de servicios. Mi experiencia se extiende a trabajos con bases de datos, abarcando la creaci칩n de procedimientos PLSQL y la reestructuraci칩n de bases de datos en PostgreSQL y SQL Server. En DevOps, he configurado entornos locales, manejando la instalaci칩n de bases de datos, Nginx, FTPS y scripts de shell. Adem치s, he demostrado competencia en Docker, orquestando infraestructuras y dockerizando diversas aplicaciones."
      }
    },
    "skills":{
      "title": "Habilidades",
      "skill_1": "Microservicios Java",
      "skill_2": "Arquitectura hexagonal",
      "skill_3": "C칩digo limpio",
      "skill_4": "Principios SOLID",
      "skill_5": "Odoo framework (Python)",
      "skill_6": "Java 8 con SPRING MVC",
      "skill_7": "Desarrollo de APIS en Node.js",
      "skill_8": "PostgreSQL y SQL Server",
      "skill_9": "React y Angular ",
      "skill_10": "Docker y orquestaci칩n de infraestructura"
    }
  },
  "footer":{
    "modified_by": " modificado por "
  }
}